docs/examples/Rate_v22/Rate  Express Freight_Request_Reply.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://fedex.com/ws/rate/v22">
   <SOAP-ENV:Body>
      <RateRequest>
         <WebAuthenticationDetail>
            <ParentCredential>
               <Key>Input Your Information</Key>
               <Password>Input Your Information</Password>
            </ParentCredential>
            <UserCredential>
               <Key>Input Your Information</Key>
               <Password>Input Your Information</Password>
            </UserCredential>
         </WebAuthenticationDetail>
         <ClientDetail>
            <AccountNumber>Input Your Information</AccountNumber>
            <MeterNumber>Input Your Information</MeterNumber>
         </ClientDetail>
         <TransactionDetail>
            <CustomerTransactionId>TC034_US_FEDEX_1_DAY_FREIGHT  with Your Packaging</CustomerTransactionId>
         </TransactionDetail>
         <Version>
            <ServiceId>crs</ServiceId>
            <Major>22</Major>
            <Intermediate>0</Intermediate>
            <Minor>0</Minor>
         </Version>
         <RequestedShipment>
            <ShipTimestamp>2016-12-12T12:34:56-06:00</ShipTimestamp>
            <DropoffType>REGULAR_PICKUP</DropoffType>
            <ServiceType>FEDEX_1_DAY_FREIGHT</ServiceType>
            <PackagingType>YOUR_PACKAGING</PackagingType>
            <TotalWeight>
               <Units>LB</Units>
               <Value>151.0</Value>
            </TotalWeight>
            <Shipper>
               <Contact>
                  <CompanyName>Input Your Information</CompanyName>
                  <PhoneNumber>Input Your Information</PhoneNumber>
               </Contact>
               <Address>
                  <StreetLines>Input Your Information</StreetLines>
                  <StreetLines>Input Your Information</StreetLines>
                  <City>Austin</City>
                  <StateOrProvinceCode>TX</StateOrProvinceCode>
                  <PostalCode>73301</PostalCode>
                  <CountryCode>US</CountryCode>
               </Address>
            </Shipper>
            <Recipient>
               <Contact>
                  <PersonName>Input Your Information</PersonName>
                  <PhoneNumber>Input Your Information</PhoneNumber>
               </Contact>
               <Address>
                  <StreetLines>Input Your Information</StreetLines>
                  <StreetLines>Input Your Information</StreetLines>
                  <City>Collierville</City>
                  <StateOrProvinceCode>TN</StateOrProvinceCode>
                  <PostalCode>38017</PostalCode>
                  <CountryCode>US</CountryCode>
               </Address>
            </Recipient>
            <ShippingChargesPayment>
               <PaymentType>SENDER</PaymentType>
               <Payor>
                  <ResponsibleParty>
                     <AccountNumber>Input Your Information</AccountNumber>
                  </ResponsibleParty>
               </Payor>
            </ShippingChargesPayment>
            <RateRequestTypes>LIST</RateRequestTypes>
            <PackageCount>1</PackageCount>
            <RequestedPackageLineItems>
               <SequenceNumber>1</SequenceNumber>
               <GroupNumber>1</GroupNumber>
               <GroupPackageCount>1</GroupPackageCount>
               <Weight>
                  <Units>LB</Units>
                  <Value>151.0</Value>
               </Weight>
               <Dimensions>
                  <Length>30</Length>
                  <Width>30</Width>
                  <Height>40</Height>
                  <Units>IN</Units>
               </Dimensions>
               <ContentRecords>
                  <PartNumber>123445</PartNumber>
                  <ItemNumber>kjdjalsro1262739827</ItemNumber>
                  <ReceivedQuantity>12</ReceivedQuantity>
                  <Description>ContentDescription</Description>
               </ContentRecords>
            </RequestedPackageLineItems>
         </RequestedShipment>
      </RateRequest>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>


<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><RateReply xmlns="http://fedex.com/ws/rate/v22"><HighestSeverity>SUCCESS</HighestSeverity><Notifications><Severity>SUCCESS</Severity><Source>crs</Source><Code>0</Code><Message>Request was successfully processed. </Message><LocalizedMessage>Request was successfully processed. </LocalizedMessage></Notifications><TransactionDetail><CustomerTransactionId>TC034_US_FEDEX_1_DAY_FREIGHT  with Your Packaging</CustomerTransactionId></TransactionDetail><Version><ServiceId>crs</ServiceId><Major>22</Major><Intermediate>0</Intermediate><Minor>0</Minor></Version><RateReplyDetails><ServiceType>FEDEX_1_DAY_FREIGHT</ServiceType><PackagingType>YOUR_PACKAGING</PackagingType><DestinationAirportId>OLV</DestinationAirportId><IneligibleForMoneyBackGuarantee>false</IneligibleForMoneyBackGuarantee><OriginServiceArea>H2</OriginServiceArea><DestinationServiceArea>H1</DestinationServiceArea><SignatureOption>SERVICE_DEFAULT</SignatureOption><ActualRateType>PAYOR_ACCOUNT_PACKAGE</ActualRateType><RatedShipmentDetails><ShipmentRateDetail><RateType>PAYOR_ACCOUNT_PACKAGE</RateType><RateScale>2174</RateScale><RateZone>04</RateZone><PricingCode>HUNDREDWEIGHT</PricingCode><RatedWeightMethod>DIM</RatedWeightMethod><DimDivisor>139</DimDivisor><FuelSurchargePercent>16.5</FuelSurchargePercent><TotalBillingWeight><Units>LB</Units><Value>259.0</Value></TotalBillingWeight><TotalDimWeight><Units>LB</Units><Value>259.0</Value></TotalDimWeight><TotalBaseCharge><Currency>USD</Currency><Amount>947.94</Amount></TotalBaseCharge><TotalFreightDiscounts><Currency>USD</Currency><Amount>28.44</Amount></TotalFreightDiscounts><TotalNetFreight><Currency>USD</Currency><Amount>919.5</Amount></TotalNetFreight><TotalSurcharges><Currency>USD</Currency><Amount>151.72</Amount></TotalSurcharges><TotalNetFedExCharge><Currency>USD</Currency><Amount>1071.22</Amount></TotalNetFedExCharge><TotalTaxes><Currency>USD</Currency><Amount>0.0</Amount></TotalTaxes><TotalNetCharge><Currency>USD</Currency><Amount>1071.22</Amount></TotalNetCharge><TotalRebates><Currency>USD</Currency><Amount>0.0</Amount></TotalRebates><TotalDutiesAndTaxes><Currency>USD</Currency><Amount>0.0</Amount></TotalDutiesAndTaxes><TotalAncillaryFeesAndTaxes><Currency>USD</Currency><Amount>0.0</Amount></TotalAncillaryFeesAndTaxes><TotalDutiesTaxesAndFees><Currency>USD</Currency><Amount>0.0</Amount></TotalDutiesTaxesAndFees><TotalNetChargeWithDutiesAndTaxes><Currency>USD</Currency><Amount>1071.22</Amount></TotalNetChargeWithDutiesAndTaxes><FreightDiscounts><RateDiscountType>EARNED</RateDiscountType><Description>Grace</Description><Amount><Currency>USD</Currency><Amount>28.44</Amount></Amount><Percent>3.0</Percent></FreightDiscounts><Surcharges><SurchargeType>FUEL</SurchargeType><Description>Fuel</Description><Amount><Currency>USD</Currency><Amount>151.72</Amount></Amount></Surcharges></ShipmentRateDetail><RatedPackages><GroupNumber>1</GroupNumber><PackageRateDetail><RateType>PAYOR_ACCOUNT_PACKAGE</RateType><RatedWeightMethod>DIM</RatedWeightMethod><BillingWeight><Units>LB</Units><Value>259.0</Value></BillingWeight><DimWeight><Units>LB</Units><Value>259.0</Value></DimWeight><BaseCharge><Currency>USD</Currency><Amount>947.94</Amount></BaseCharge><TotalFreightDiscounts><Currency>USD</Currency><Amount>28.44</Amount></TotalFreightDiscounts><NetFreight><Currency>USD</Currency><Amount>919.5</Amount></NetFreight><TotalSurcharges><Currency>USD</Currency><Amount>151.72</Amount></TotalSurcharges><NetFedExCharge><Currency>USD</Currency><Amount>1071.22</Amount></NetFedExCharge><TotalTaxes><Currency>USD</Currency><Amount>0.0</Amount></TotalTaxes><NetCharge><Currency>USD</Currency><Amount>1071.22</Amount></NetCharge><TotalRebates><Currency>USD</Currency><Amount>0.0</Amount></TotalRebates><FreightDiscounts><RateDiscountType>EARNED</RateDiscountType><Description>Grace</Description><Amount><Currency>USD</Currency><Amount>28.44</Amount></Amount><Percent>3.0</Percent></FreightDiscounts><Surcharges><SurchargeType>FUEL</SurchargeType><Description>Fuel</Description><Amount><Currency>USD</Currency><Amount>151.72</Amount></Amount></Surcharges></PackageRateDetail></RatedPackages></RatedShipmentDetails><RatedShipmentDetails><ShipmentRateDetail><RateType>PAYOR_LIST_PACKAGE</RateType><RateScale>2174</RateScale><RateZone>04</RateZone><PricingCode>HUNDREDWEIGHT</PricingCode><RatedWeightMethod>DIM</RatedWeightMethod><DimDivisor>139</DimDivisor><FuelSurchargePercent>7.0</FuelSurchargePercent><TotalBillingWeight><Units>LB</Units><Value>259.0</Value></TotalBillingWeight><TotalDimWeight><Units>LB</Units><Value>259.0</Value></TotalDimWeight><TotalBaseCharge><Currency>USD</Currency><Amount>947.94</Amount></TotalBaseCharge><TotalFreightDiscounts><Currency>USD</Currency><Amount>0.0</Amount></TotalFreightDiscounts><TotalNetFreight><Currency>USD</Currency><Amount>947.94</Amount></TotalNetFreight><TotalSurcharges><Currency>USD</Currency><Amount>66.36</Amount></TotalSurcharges><TotalNetFedExCharge><Currency>USD</Currency><Amount>1014.3</Amount></TotalNetFedExCharge><TotalTaxes><Currency>USD</Currency><Amount>0.0</Amount></TotalTaxes><TotalNetCharge><Currency>USD</Currency><Amount>1014.3</Amount></TotalNetCharge><TotalRebates><Currency>USD</Currency><Amount>0.0</Amount></TotalRebates><TotalDutiesAndTaxes><Currency>USD</Currency><Amount>0.0</Amount></TotalDutiesAndTaxes><TotalAncillaryFeesAndTaxes><Currency>USD</Currency><Amount>0.0</Amount></TotalAncillaryFeesAndTaxes><TotalDutiesTaxesAndFees><Currency>USD</Currency><Amount>0.0</Amount></TotalDutiesTaxesAndFees><TotalNetChargeWithDutiesAndTaxes><Currency>USD</Currency><Amount>1014.3</Amount></TotalNetChargeWithDutiesAndTaxes><Surcharges><SurchargeType>FUEL</SurchargeType><Description>Fuel</Description><Amount><Currency>USD</Currency><Amount>66.36</Amount></Amount></Surcharges></ShipmentRateDetail><RatedPackages><GroupNumber>1</GroupNumber><PackageRateDetail><RateType>PAYOR_LIST_PACKAGE</RateType><RatedWeightMethod>DIM</RatedWeightMethod><BillingWeight><Units>LB</Units><Value>259.0</Value></BillingWeight><DimWeight><Units>LB</Units><Value>259.0</Value></DimWeight><BaseCharge><Currency>USD</Currency><Amount>947.94</Amount></BaseCharge><TotalFreightDiscounts><Currency>USD</Currency><Amount>0.0</Amount></TotalFreightDiscounts><NetFreight><Currency>USD</Currency><Amount>947.94</Amount></NetFreight><TotalSurcharges><Currency>USD</Currency><Amount>66.36</Amount></TotalSurcharges><NetFedExCharge><Currency>USD</Currency><Amount>1014.3</Amount></NetFedExCharge><TotalTaxes><Currency>USD</Currency><Amount>0.0</Amount></TotalTaxes><NetCharge><Currency>USD</Currency><Amount>1014.3</Amount></NetCharge><TotalRebates><Currency>USD</Currency><Amount>0.0</Amount></TotalRebates><Surcharges><SurchargeType>FUEL</SurchargeType><Description>Fuel</Description><Amount><Currency>USD</Currency><Amount>66.36</Amount></Amount></Surcharges></PackageRateDetail></RatedPackages></RatedShipmentDetails></RateReplyDetails></RateReply></SOAP-ENV:Body></SOAP-ENV:Envelope>

